import { Paper, Typography } from "@mui/material";
import React from "react";

export const Offer = () => {
    return (
        
            <Paper sx={{ width: "100%", padding: "20px" }}>
                <Typography>
                ДОГОВОР-ОФЕРТА О ПРЕДОСТАВЛЕНИИ ИНФОРМАЦИОННЫХ УСЛУГ
                    <br />
                    <br />
Настоящий Договор является публичным договором-офертой (предложением) Самозанятого Саввинова Семёна Афанасьевича ИНН 140204032344 (далее — «Исполнитель»), с любым физическим лицом, которое примет настоящее предложение на указанных ниже условиях (далее — «Пользователь»).<br/>
Принимая условия настоящего Договора, Пользователь тем самым выражает полное и безоговорочное согласие со всеми его условиями.<br/>
Пользователь, принимая условия настоящего Договора, подтверждает свою полную дееспособность.<br/>
Игра «ochem.ru» (далее — «Игра») является программой для ЭВМ, размещенной в сети Интернет по адресу https://www.ochem.ru, и представляет из себя совокупность данных и команд, предназначенных для функционирования электронных вычислительных машин, в том числе подготовительные материалы, полученные в ходе ее разработки, и порождаемые ею аудиовизуальные отображения.<br/>
Правообладателем, т.е. лицом, которому принадлежат исключительные права на использование Игры, является Исполнитель. Права Правообладателя на Игру защищены Законом РФ от 9 июля 1993 г. №5351-I «Об авторском праве и смежных правах», Законом РФ от 23 сентября 1992 г. №3523-I «О правовой охране программ для электронных вычислительных машин и баз данных», а также другими нормами международного и российского законодательства об охране интеллектуальной собственности и авторских правах.
<br/><br/>
1. Предмет договора
<br/><br/>
1.1.  Исполнитель предоставляет Пользователю информационные услуги, связанные с участием Пользователя в Игре, а Пользователь обязуется соблюдать условия настоящего Договора.
<br/><br/>
2. Общие положения
<br/><br/>
2.1. Игра размещена в сети Интернет по адресу: https://ochem.ru (https://www.ochem.ru).<br/>
В Игре одновременно могут принимать участие большое количество пользователей.<br/>
2.2 Исполнитель обязуется обеспечить без взимания платы доступ Пользователя к Игре. Пользователь самостоятельно за свой счет оплачивает доступ в сеть Интернет.
По желанию пользователя Исполнитель предоставляет Пользователю дополнительные платные услуги, порядок и условия пользования которыми определены в Разделе 5 настоящего Договора.<br/>
2.3. Правила Игры приведены в сети Интернет по адресу https://www.ochem.ru/info, составляют неотъемлемую часть настоящего Договора и обязательны для исполнения всеми Пользователями.<br/>
2.4. Пользователем игры является дееспособное физическое лицо, получившее доступ к Игре в соответствии с настоящим Договором и использующее материалы и компоненты, размещенные на https://www.ochem.ru, исключительно в личных целях.<br/>
2.5. Под материалами и компонентами Игры понимаются любой текст, фотографические изображения, образы, графика, а также любые данные в визуальной, аудио или аудиовизуальной либо иной форме, находящиеся на сайте https://www.ochem.ru, за исключением материалов, загруженных Пользователями в рамках игрового процесса.<br/>
2.6. В случае нарушения Пользователем настоящего Договора Исполнитель вправе отказать ему в дальнейшем использовании Игры.
<br/><br/>
3. Права и обязанности Пользователя
<br/><br/>
3.1. Права Пользователя<br/>
3.1.1. Пользователь имеет право пользоваться Игрой исключительно в некоммерческих личных целях в соответствии с правилами Игры.<br/>
3.1.2. При регистрации Пользователь выбирает себе логин («никнейм», «ник»), который позволяет идентифицировать Пользователя среди других пользователей Игры. При регистрации Пользователь обязан указать следующие достоверные данные о себе: возраст, пол, адрес электронной почты.<br/>
3.1.3. Активация учётной записи Пользователя («Персонажа») происходит при первом использовании пары «Логин-Пароль» для авторизации в Игре. Пользователь имеет право на изменение своего пароля. При этом Пользователь обязан самостоятельно обеспечивать неразглашение (тайну) своего пароля и иных необходимых данных и соответственно несет ответственность за сохранение и неразглашение своего пароля, а также все риски (убытки), связанные с этим.<br/>
3.1.4. Пользователь вправе одновременно иметь только одного персонажа. Пользователь не имеет права передавать свою регистрацию (логин и пароль) третьему лицу, а также не имеет права получать их от третьего лица.<br/>
3.1.5. Пользователь может направить претензии и предложения, связанные с использованием Игры по электронной почте по адресу Исполнителя, указанному в настоящем Договоре.<br/>
3.2. Обязанности Пользователя<br/>
3.2.1. По требованию Исполнителя Пользователь обязан сообщить о себе достоверную информацию, позволяющую идентифицировать владельца персонажа.<br/>
3.2.2. Пользователь не имеет права использовать ошибки программного обеспечения и обязан незамедлительно сообщать о них Исполнителю, вмешиваться в программный код, несанкционированно получать доступ к компьютерной системе, получать, без надлежащего разрешения Исполнителя, доступ к базе данных пользователей Игры или материалов https://www.ochem.ru. При обнаружении подобных попыток Исполнитель вправе подать материалы в органы внутренних дел для возбуждения уголовного дела по статье 272 Уголовного Кодекса Российской Федерации или иным аналогичным законам стран - мест пребывания нарушителя.<br/>
3.2.3. Пользователь не имеет право распространять информацию, направленную на незаконное получение паролей доступа к персонажам Игры, а также распространять ссылки на сайты с подобной информацией.<br/>
3.2.5. Пользователь обязуется уважительно и корректно относиться к другим пользователям Игры, а именно: не использовать ненормативную лексику, не распространять каким-либо образом материалы, пропагандирующие либо выражающие неприятие или ненависть к какой-либо религии, культуре, расе, нации, народу, языку, политике, идеологии или общественному движению; не размещать информацию рекламного характера, в том числе ссылки на Интернет-ресурсы, содержащие сведения рекламного характера.<br/>
3.2.6. Пользователь не вправе ограничивать доступ других Пользователей к Игре или препятствовать другим Пользователям в использовании Игры.<br/>
3.2.7. Пользователь обязуется не передавать любую информацию или программное обеспечение, которое содержит в себе вирусы или иные вредные компоненты, а также совершать иные действия, которые противоречат нормам действующего законодательства РФ.<br/>
3.2.8. Пользователю запрещается копирование, воспроизводство, распространение и перевод на другие языки любого компонента Игры без письменного разрешения Исполнителя. Пользователь признает и соглашается с тем, что любой материал и все необходимые программы, связанные с Игрой, защищены законами об интеллектуальной собственности РФ, а контент, предоставляемый Пользователю в процессе использования Игры, защищен авторскими правами. Пользователь не имеет права модифицировать, продавать, распространять этот контент, материал Игры и программы, целиком либо по частям. Исполнитель предоставляет Пользователю личное неисключительное и непередаваемое право использовать контент, материал Игры и программное обеспечение, предоставляемое в Игре в соответствии с правилами Игры, при условии, что ни Пользователь, ни любые иные лица при содействии со стороны Пользователя не будут копировать или изменять контент и программное обеспечение; создавать программы, производные от программного обеспечения; проникать в программное обеспечение с целью получения кодов программ; осуществлять продажу, уступку, сдачу в аренду, передачу третьим лицам в любой иной форме прав в отношении материала Игры и программного обеспечения Игры, а также модифицировать сервис, в том числе с целью получения несанкционированного доступа к нему.<br/>
3.2.10. Пользователь соглашается, что в случае нарушения им своих обязанностей Исполнитель вправе в любой момент применить к нему санкции, выражающиеся в запрете Пользователю пользоваться Игрой, либо использовать к нему иные методы воздействия: предупреждение, временное блокирование пользования Игрой, требование о возмещении убытков и иные действия.
<br/><br/>
4. Права и обязанности Исполнителя
<br/><br/>
4.1. Исполнитель обязуется не разглашать преднамеренно информацию о Пользователе, предоставленную им при регистрации, третьим лицам за исключением случаев, предусмотренных законодательством РФ, а также не изменять логин и пароль Пользователя без его согласия, за исключением случаев, когда таковое изменение направлено на повышение безопасности учётной записи пользователя.<br/>
4.2. Исполнитель не несет ответственности за временные технические сбои и перерывы в работе Игры, за временные сбои и перерывы в работе линий связи, иные аналогичные сбои, а также за неполадки компьютера, с которого Пользователь осуществляет выход в Интернет.<br/>
4.3. Исполнитель не несет ответственности за убытки, понесенные в результате использования или неиспользования Пользователем информации об Игре.<br/>
4.4. Исполнитель обязуется поддерживать исправность программных средств, используемых для приема информации о передаче денежных средств.<br/>
4.5. Исполнитель имеет право в одностороннем порядке уменьшать игровой счет Пользователя при обнаружении недобросовестности действий Пользователя, приведших к необоснованному увеличению его игрового счета.<br/>
4.6. Исполнитель не несет ответственности перед Пользователем за действия других Пользователей.<br/>
4.7. Исполнитель имеет право на удаление или изменение любой информации, размещенной Пользователем на https://www.ochem.ru без предварительного согласования с Исполнителем или не предусмотренной настоящим Договором, а также иными соглашениями с Исполнителем.<br/>
4.8. Исполнитель имеет право делегировать все или часть своих прав и/или обязанностей по настоящему Договору другим физическим или юридическим лицам (в т.ч. другим Пользователям) на основании заключённых с ними соглашений или договоров.<br/>
<br/>
5. Платные услуги Игры «ochem.ru»
<br/><br/>
5.1. Пользователь имеет право по своему усмотрению пользоваться дополнительными платными услугами Игры.<br/>
5.2. Платными услугами Игры вправе пользоваться дееспособные Пользователи, достигшие возраста совершеннолетия.<br/>
5.3. Использование платных услуг Игры осуществляется на основании настоящего Договора в порядке, определенном в правилах Игры.<br/>
5.4. Пользователь допускается к использованию платных услуг Игры с момента оплаты.<br/>
5.5. Исполнитель обязуется указывать полные и достоверные сведения о стоимости услуг и порядке их оплаты на сайте Игры.<br/>
5.6. Перечень и стоимость платных услуг:<br/>
5.6.1. Пополнение внутриигрового баланса пользователя в игровой валюте «RSVP» — 99 ₽ за 10 единиц игровой валюты, 199 ₽ за 30 единиц игровой валюты, 499 ₽ за 100 единиц игровой валюты.<br/>
5.6.2. Установка статуса «СПОНСОР» для персонажа:<br/>
5.6.2.1. на 1 месяц — 299 ₽;<br/>
5.6.2.2. на 12 месяцев — 1990 ₽.<br/>
<br/>
6. Особые условия<br/>
<br/>
6.1. Любое использование материалов, их подборки, дизайна и элементов дизайна, составляющих Игру, может осуществляться лишь с разрешения Исполнителя и только при наличии активной ссылки на ресурс https://www.ochem.ru.<br/>
6.2. Исполнитель не несет ответственности за убытки или иной вред, возникший у Пользователя в связи с действиями третьих лиц.<br/>
6.3. Исполнитель оставляет за собой право удалять со своих серверов любую информацию или материалы, которые, по мнению Исполнителя, являются неприемлемыми, нежелательными или нарушающими настоящий Договор.<br/>
6.4. Исполнитель вправе в одностороннем порядке и в любое время ограничить, расширить или изменить качество услуг без предварительного уведомления Пользователя.<br/>
6.5. Исполнитель вправе в одностороннем порядке и в любое время изменять условия настоящего Договора. Изменения вступают в силу с момента опубликования их на сайте Игры. Актуальная версия Договора размещается на сайте Игры по адресу https://www.ochem.ru/info. При пользовании сервисом Игры Пользователь соглашается, что к нему применимы все изменения Договора с момента их публикации на этой странице. Пользователь обязуется периодически посещать эту страницу для ознакомления с актуальными положениями Договора.<br/>
6.6. Споры, возникающие из настоящего Договора, подлежат разрешению путем переговоров. В случае неурегулирования спора во внесудебном порядке, он передается на разрешение в соответствующий судебный орган.<br/>
<br/>
7. Вступление в силу и срок действия Договора<br/>
<br/>
7.1. Настоящий Договор вступает в силу при его акцептовании Пользователем на сайте https://www.ochem.ru путем выбора и нажатия Пользователем опции «Согласен» при регистрации учётной записи. Пользователь соглашается, что выбор им вышеуказанной опции означает, что он предварительно и в полном объеме ознакомился с условиями настоящего Договора и принимает их без каких-либо исключений.<br/>
7.2. Договор заключается на неопределенный срок.<br/>
7.3. Исполнитель вправе в одностороннем порядке отказаться от настоящего Договора и прекратить предоставление услуг по пользованию Игрой без возмещения убытков с предварительным уведомлением Пользователя расторжении Договора не менее, чем за 10 дней. Информирование может быть произведено путем опубликования данной информации на сайте https://www.ochem.ru.<br/>
7.4. Все изменения, дополнения, приложения к настоящему Договору являются неотъемлемой его частью и являются обязательными для исполнения сторонами с момента опубликования их на сайте https://www.ochem.ru. По всем вопросам, не урегулированным в Договоре, Стороны руководствуются действующим законодательством РФ.
<br/><br/>
Самозанятый <br/>
Саввинов Семён Афанасьевич <br/>
ИНН 140204032344<br/>
                </Typography>
            </Paper>
        
    );
};
