import { Paper, Typography } from "@mui/material";
import React from "react";

export const Offer = () => {
    return (
        
            <Paper sx={{ width: "100%", padding: "20px" }}>
                <Typography>
                    Договор-оферта на оказание услуг по привлечению клиентов
                    <br />
                    <br />
                    Настоящий публичный договор (далее — Договор) представляет собой официальное предложение Самозанятого Саввинова Семёна Афанасьевича (ИНН 140204032344), 
                    в дальнейшем «Заказчик», адресованной:<br/>

                    юридическим лицам и индивидуальным предпринимателям, зарегистрированным по законодательству Российской Федерации; 

                    достигшим возраста полной дееспособности физическим лицам независимо от гражданства, выступающим без предпринимательского или иного специального хозяйственного статуса;

                    индивидуальным предпринимателям, зарегистрированным на территории РФ, являющимися плательщиками налога на профессиональный доход в соответствии с федеральным законом № 422-ФЗ от 27.11.2018 в связи с доходами полученными в рамках Партнерской сети; 

                    Оферта адресована для заключения договора на оказание услуг по продвижению предложений рекламодателей путем привлечения целевого трафика (далее – трафик), то есть конечных пользователей (клиентов) для совершения такими клиентами целевых действий.<br/><br/>

                    Лицо, акцептовавшее оферту, рассматривается как «Партнер», вступивший с Заказчиком в договорные отношения. Настоящая оферта не распространяется на физических лиц, не имеющих соответствующим образом зарегистрированного статуса индивидуального предпринимателя для осуществления предпринимательской деятельности и граждан, являющихся плательщиками налога на профессиональный доход.<br/><br/>

                    Заказчик и Партнер по отдельности именуются «Сторона», а совместно — «Стороны».<br/><br/>

                    Договор считается заключенным на изложенных условиях и действует с момента осуществления акцепта. Моментом акцепта признается факт нажатия кнопки «Зарегистрироваться», успешное прохождение регистрации в Программном продукте и оплата. Для уже зарегистрированных Партнеров акцепт выражается в продолжении участия в партнерской сети и наступает с момента опубликования первой редакции настоящей оферты. Действие Договора может быть прекращено по основаниям, которые предусмотрены в самом Договоре и установлены применимым законодательством.<br/><br/>

                    Акцепт Договора подразумевает согласие Партнера с условиями использования партнерской сети (Правила), политикой в отношении обработки данных communicationcompass.ru (Политика) и иными обязательными документами для Партнеров. При использовании термина «Договор», подразумеваются, как и текст настоящей оферты, так и указанные выше документы в их совокупности. Для целей ведения отчетности в рамках ведения предпринимательской деятельности Стороны устанавливают, что дата акцепта считается датой заключения Договора.<br/><br/>

                    1. ПРЕДМЕТ ДОГОВОРА<br/><br/>

                    1.1. Партнер лично за оплату и по заданию Заказчика с помощью программных инструментов, предоставляемых в партнерской сети в период действия Договора оказывает услуги по привлечению трафика. Привлечение трафика осуществляется путем привлечения клиентов для использования интернет-сервисов, программных онлайн продуктов и интернет-ресурсов рекламодателей. Клиенты привлекаются с целью поиска ими товаров-услуг в личных целях и последующего совершения целевого действия – приобретения клиентами соответствующих товаров и/или услуг.<br/><br/>

                    1.2. Партнер привлекает клиентов для совершения целевого действия с помощью:<br/><br/>

                    размещения на своих интернет-ресурсах гипертекстовых ссылок или других предоставленных Заказчиком программных и, если применимо, рекламно-информационных материалов;<br/>
                    интеграции поисковых элементов (API, White Label) в интернет-ресурсы Партнера;<br/>
                    размещения мобильных приложений Партнера на основе SDK Заказчика;<br/>
                    легальной рассылки электронных писем, содержащих ссылки на ресурсы и интернет-сервисы или размещение программных инструментов для сбора подписок на рассылки; <br/>
                    иных согласованных Сторонами дополнительно способов.<br/><br/>

                    1.3. Оплата услуг осуществляется только в случае привлечения целевого трафика – то есть за совершенные клиентами целевые действия (заключенные клиентом сделки по приобретению товаров-услуг, иные действия согласно Договору). За каждое приобретение товаров-услуг клиентами, которых привлек Партнер, Заказчик обязуется оплачивать Партнеру услуги согласно правилам соответствующего предложения по привлечению трафика (партнерской программы), за исключением случаев, предусмотренных Договором.<br/><br/>

                    2. УСЛОВИЯ ПРИВЛЕЧЕНИЯ КЛИЕНТОВ<br/><br/>

                    2.1. После регистрации Партнера в партнерской сети и присвоения ему индивидуального никнейма (маркера) Заказчик в течение всего срока сотрудничества будет:<br/><br/>

                    2.1.1. Предоставлять Партнеру непередаваемое право использования программного и графического интерфейса партнерской сети communicationcompass.ru для участия в ней на территории всех стран мира на условиях безвозмездной неисключительной лицензии. Право предоставляется только для использования по прямому функциональному назначению в соответствии с Договором и Правилами.<br/><br/>

                    2.1.2. Обеспечивать работоспособность своих сервисов по поиску товаров-услуг, а также информировать Партнера о возможных изменениях в их работе.<br/><br/>

                    2.1.3. Организовывать учет переходов клиентов с интернет-ресурсов Партнера и инструментов продвижения, в которых используется Партнерский маркер и учет совершенных целевых действий, являющихся основанием для оплаты услуг и совершенных клиентами в результате таких переходов.<br/><br/>

                    2.1.4. Оказывать консультации по работе сервисов и партнерской сети, необходимую для сотрудничества по Договору в соответствии с порядком, который предусмотрен Правилами партнерской сети. <br/><br/>

                    2.2. Партнер при оказании услуг обязуется:<br/><br/>

                    2.2.1. Размещать в HTML-коде собственных интернет-ресурсов (сайты, мобильные приложения и т.п.) или иным применимым способом использовать присвоенный ему маркер для ведения Заказчиком учета в соответствии с пп. 2.1.3. Договора. Партнер соглашается с тем, что для расчета стоимости услуг учитываются только те целевые действия, которые могут быть предметом учета, то есть осуществлены с интернет-ресурсов или инструментов с Партнерским маркером. <br/><br/>

                    2.2.2. Незамедлительно информировать Заказчика обо всех случаях сбоев, неточностей и ошибок в программных инструментах и сервисах Заказчика и/или третьих лиц, о которых Партнеру стало известно в ходе сотрудничества и которые препятствуют или могут препятствовать оказанию услуг.<br/><br/>

                    2.2.3. По запросу Заказчика письменно в удобной для Сторон форме отчитываться об оказываемых услугах (мероприятиях для привлечения трафика) не позднее, чем через 1 (один) рабочий день с момента направления запроса. <br/><br/>

                    2.2.4. Своевременно доводить до сведения клиентов в доступной форме точную и достоверную информацию о работе программных инструментов и сервисов Заказчика, рекламодателей используемых Партнером в ходе оказания услуг. Не вводить пользователей своих интернет-ресурсов в заблуждение относительно свойств и функций сервисов Заказчика, рекламодателей и свойств интернет-ресурса Партнера. <br/><br/>

                    2.2.5. При самостоятельной обработке любых данных клиентов с помощью программных средств Заказчика на своих интернет-ресурсах (если это такая возможность предоставляется) следовать правилам и условиям обработки, которые, предусмотрены Политикой, обеспечивать безопасность данных клиентов в объеме не меньшем, чем установлено в Политике. Незамедлительно сообщать Заказчику о любых нарушениях целостности и безопасности данных клиентов, о которых становится известно Партнеру.  <br/><br/> 

                    2.3. Партнер, участвуя в партнерской сети и при непосредственном оказании услуг обязуется не вести противозаконную деятельность, не нарушать права и законные интересы третьих лиц, а также не совершать действий или бездействовать, если в результате этого может быть нанесен ущерб сотрудничеству Сторон, деловой репутации Заказчика и его контрагентов. В частности, Партнер гарантирует, что:<br/><br/>

                    2.3.1. Не будет рассылать электронных писем и иных сообщений интернет-пользователям без их явно выраженного согласия и/или с нарушением применимого законодательства (производить спам-рассылки).  <br/><br/>

                    2.3.2. Не будет размещать на интернет-ресурсах третьих лиц инструменты продвижения или иные материалы, прямо или косвенно направляющие на сервисы Заказчика, рекламодателей без согласия таких третьих лиц.<br/><br/>

                    2.3.3. Не будет создавать паразитную нагрузку на сервисы Заказчика, то есть привлекать/осуществлять переходы на них, совершенные не с целью поиска и приобретения товаров-услуг (совершения целевых действий) в личных целях интернет-пользователей, а для искусственного завышения статистики Партнера или намеренного повышения нагрузки на интернет-сервисы и ресурсы Заказчика. <br/><br/>

                    2.3.4. Не будет привлекать несогласованные или запрещенные типы трафика или использовать запрещенные типы проектов для привлечения клиентов  в соответствии с Правилами и правилами партнерских программ. Не будет использовать мотивированный трафик для продвижения по ключевым запросам в магазинах предложений. <br/><br/>

                    2.3.5. Никаким образом не будет нарушать и/или вмешиваться в работу сервисов Заказчика, рекламодателей, инструментов и программных продуктов партнерской сети, осуществлять их модификацию либо усовершенствование кода, перевод на другие языки кодирования, декомпилирование, дизассемблирование, декодирование, эмуляцию, нарушение целостности, восстановление исходного кода полностью или частично. <br/><br/>

                    2.3.6. Не будет использовать любые неавторизованные Заказчиком программные обеспечения, программы или приложения для взаимодействия с сервисами, программными продуктами и инструментами партнерской сети; <br/><br/>

                    2.3.7. В течение 12 (двенадцати) часов будет предоставлять мотивированный ответ по существу запроса Заказчика, если такой запрос связан с предполагаемым нарушением Правил и Договора. <br/><br/>

                    2.4. Партнер при привлечении клиентов обязуется не нарушать прав на объекты интеллектуальной собственности Заказчика, его контрагентов и принципалов, представленных в рамках сервисов, на ресурсах и партнерской сети, в том числе и рекламодателей, а также любых третьих лиц. В частности, Партнер не может:<br/><br/> 

                    2.4.1. использовать в своей деятельности по привлечению трафика доменные имена или другие формы идентификации интернет-ресурсов на любых языках, созвучные или схожие любым иным образом до степени смешения с брендом (зарегистрированными товарными знаками, доменными именами, логотипами, фирменным стилем и другими объектами интеллектуальной собственности) Заказчика, его контрагентов, принципалов, рекламодателей и любых других третьих лиц;<br/><br/> 

                    2.4.2.Вышеуказанный запрет на использование распространяется и на рекламную деятельность Партнера по привлечению трафика на свои интернет-ресурсы, в частности, Партнера в связи с оказываемыми услугами и во время сотрудничества обязуется не использовать бренды, которые используются Заказчиком в партнерской сети, бренды его контрагентов и рекламодателей, для проведения рекламных кампаний в системах контекстной рекламы или иными способами.
                    <br/><br/>
                    3. ОПЛАТА УСЛУГ ПАРТНЕРА. РАСЧЕТЫ ПО ДОГОВОРУ<br/><br/>

                    3.1. Партнер получает вознаграждение за совершенные клиентами в личных целях и не отмененные в дальнейшем целевые действия (для партнерских программ Заказчика – приобретенные товары-услуги, найденные с помощью сервисов Заказчика), если они совершены после перехода с интернет-ресурсов Партнера, которые содержат маркер Партнера. <br/><br/>

                    3.2. Для расчета стоимости услуг в рамках партнерских программ Заказчика учитываются продажи, совершенные с компьютеров или мобильных устройств клиентов в течение 30 (тридцати) календарных дней (или менее в зависимости от условий, согласованных Заказчиком с конкретным поставщиком товара-услуги) с момента первого перехода на сервисы/использования клиентом сервиса Заказчика. Учет клиентов производится на основе файлов cookie.<br/><br/>

                    3.3. Стоимость услуг за отчетный период (календарный месяц) рассчитывается как доля от дохода Заказчика, который получен Заказчиком от третьих лиц-поставщиков товаров-услуг, реализующих с помощью сервисов Заказчика. Партнер соглашается, что система и критерии расчета стоимости услуг и процентные ставки за совершенные целевые действия устанавливаются для каждой партнерской программы Заказчика и рекламодателей отдельно и указываются на странице такой партнерской программы в личном кабинете. <br/><br/>

                    3.4. Заказчик предоставляет статистику о совершенных целевых действиях после перехода клиентов с интернет-ресурсов Партнера, и полученных вследствие этого доходов в режиме реального времени. Статистика предоставляется в личном кабинете Партнера, формат статистического отчета и состав его дополнительных данных определяются Заказчиком и могут быть изменены без предварительного уведомления. Данные отчета Стороны признают единственным и достоверным источником об объеме оказанных Партнером услуг и их стоимости и соглашаются о возможности использования таких данных в качестве отчетных документов для целей применимого законодательства.<br/><br/>

                    3.5. Оплата услуг Партнеру в течении 30 рабочих дней (в зависимости от нагрузки на интернет-сервис) после получения заявки на выплату. Выплата осуществляется путем перечисления денежных средств на реквизиты платежного инструмента Партнера, указанные в личном кабинете.<br/><br/>

                    3.6. Любые комиссии банков, платежных систем и операторов, начисленные в ходе взаиморасчетов по Договору, ложатся на ту Сторону, чей банк, платежная система или оператор начислили такую комиссию. <br/><br/>

                    3.7. Партнер самостоятельно осуществляет учет, уплату применимых к его доходу налогов и иных обязательных платежей в связи с получением оплаты за услуги по Договору. Суммы оплаты, выплачиваемые Партнеру, являются полными и включают в себя любой применимый налог и расходы в связи с оказанием услуг.<br/><br/>

                    3.8. Партнер соглашается, что любые денежные обязательства, существующие между Сторонами по иным соглашениям или договорам, в том числе в рамках партнерской сети, могут быть предметом зачета с денежными обязательствами по настоящему Договору.<br/><br/>

                    4. ОСОБЫЕ УСЛОВИЯ<br/><br/>

                    4.1. Все уведомления, требования, извещения, документы, претензии и т.п. в связи с исполнением Договора могут быть направлены с помощью средств электронной связи по контактным данным Сторон указанным в Договоре и личном кабинете Партнера.<br/><br/>

                    4.2. Партнер обязуется предоставить по запросу Заказчика в электронном виде или на указанный адрес в срок не позднее 5 (пяти) рабочих дней с момента направления такого запроса (или более короткий срок, если это предусмотрено рабочей необходимостью и в интересах Сторон) любые документы, если такие документы необходимы для надлежащего исполнения Заказчиком действующего законодательства РФ, настоящего Договора, в частности, для оплаты услуг. В случае невыполнения такого запроса, несовременного его выполнения либо в случае предоставления недостоверных или неполных сведений, Заказчик не несет ответственности за неблагоприятные для Партнера последствия.<br/><br/>

                    4.3. Партнер для целей сотрудничества и надлежащего исполнения обязательств по Договору передает Заказчику всю необходимую и достоверную информацию о своих регистрационных, контактных данных и реквизитах платежного инструмента. Партнер будет своевременно обновлять такую информацию, в частности, о реквизитах своего платежного инструмента в личном кабинете партнерской сети. В случаях, когда Заказчик не может связаться с Партнером по его контактным данным, адресу или выплатить по указанным реквизитам стоимость услуг или исполнить любые другие обязательства по Договору,  выполнение которых зависит от актуальности/наличия данных Партнера, Заказчик не принимает на себя указанные обязательства и/или их выполнение откладывается либо отменяется до актуализации всех сведений или выполнения необходимых встречных действий Партнером.<br/><br/>

                    4.4. При обнаружении факта предоставления Партнером заведомо недостоверных сведений при акцепте и в ходе исполнения Договора, Заказчик вправе по своему выбору потребовать предоставления достоверных сведений и подтверждающих такие сведения документов или отказаться от исполнения Договора без оплаты любых услуг.<br/><br/>

                    4.5. Партнер соглашается с тем, что Заказчик вправе немотивированно в любой момент отказаться от исполнения Договора полностью или частично без предварительного уведомления Партнера и заблокировать его доступ к соответствующему функционалу партнерской сети, если сочтет такое действие целесообразным в интересах работы партнерской сети. При таком отказе Заказчик обязуется оплатить услуги, добросовестно оказанные Партнером до момента отказа Заказчика.<br/><br/>

                    4.6. Детали сотрудничества в рамках партнерской сети, факты исполнения обязательств, оплат, данные Партнера и иные сведения в связи с Договором являются конфиденциальными. Указанные сведения должны быть надежно охраняться Сторонами от несанкционированного доступа и не подлежат разглашению без предварительного согласия второй Стороны. Допускается передача такой информации Стороной в случае, если это требуется в связи с установленными законом обязанностями Стороны.<br/><br/>

                    5. ОТВЕТСТВЕННОСТЬ СТОРОН<br/><br/>

                    5.1. В случае неисполнения или ненадлежащего исполнения обязательств в рамках сотрудничества Стороны несут ответственность в объемах и порядке, установленном действующим законодательством РФ, если иное не установлено в Договоре.<br/><br/>

                    5.2. При обнаружении Заказчиком фактов нарушения Партнером своих Договорных обязательств и гарантий или обязательств и гарантий, установленных в правилах конкретной партнерской программы, участником которой является Партнер, Заказчик по своему выбору:<br/><br/>

                    5.2.1. прекращает в одностороннем внесудебном порядке сотрудничество по Договору, не оплачивая Партнеру услуги и требуя возмещения убытков, понесенных сверх суммы невыплаченной стоимости услуг;<br/><br/>

                    5.2.2. требует незамедлительного устранения нарушения, а в случае невыполнения требования Партнером в разумный срок, использовать право, установленное пп. 5.2.1.;<br/><br/>

                    5.2.3. не оплачивает услуги за отчетный период, в котором имел место факт нарушения.<br/><br/>

                    5.3. Заказчик уведомляет Партнера, что право использования инструментов и функционала партнерской сети предоставляется на условиях «как есть» (as is). Заказчик не несет ответственности за любые последствия использования или невозможности их использования Партнером при оказании услуг, за возможные сбои в работе партнерской сети или сбои в работе отдельных инструментов.<br/><br/>

                    5.4. Стороны освобождаются от ответственности за неисполнение или ненадлежащее обязательств по Договору, если оно явилось следствием обстоятельств непреодолимой силы, и если данные обстоятельства непосредственно повлияли на исполнение обязательств, при этом срок исполнения обязательств отодвигается соразмерно времени, в течение которого действовали такие обстоятельства.<br/><br/>

                    5.5. Сторона, для которой создалась невозможность исполнения обязательств, уведомляет об этом другую Сторону вместе с указанием на факт наступления обстоятельств непреодолимой силы в течение 3 (трех) рабочих дней со дня их наступления.<br/><br/>

                    6. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ<br/><br/>

                    6.1. Все споры в связи с заключением, прекращением, исполнением и нарушениями Договора должны разрешаться Сторонами с помощью переговоров в рамках партнерской сети или с использованием других согласованных каналов связи, а также добросовестно и в разумные сроки.<br/><br/>

                    6.2. Заказчик вправе изменять условия Договора, обновлять текст настоящей оферты и других документов, составляющих Договор, в одностороннем порядке без предварительного уведомления Партнера. Информация о внесенных изменениях публикуется на страницах в личном кабинете.<br/><br/>

                    6.3. Партнер обязуется самостоятельно отслеживать изменения, которые вносятся в условия сотрудничества и тексты соответствующих документов. Факт продолжения оказания Партнером услуг означает согласие Партнера с новыми условиями.<br/><br/>

                    6.4. Партнер не вправе каким-либо образом передавать свои права и обязанности по настоящему Договору третьим лицам без предварительного письменного согласия Заказчика. Заказчик вправе передать обязательства и права по Договору или в связи с ним полностью или частично, уведомив, если это необходимо, Партнера по электронной почте из личного кабинета.<br/><br/>

                    6.5. В случае изменения статуса Партнера, как хозяйствующего субъекта, и, как следствие, изменения применимой к сотрудничеству оферты, все риски из ненадлежащего и несвоевременного уведомления Заказчика о таких изменениях несет Партнер. Услуги, оказанные Партнером после изменений в его статусе, но до уведомления Заказчика о таком изменении, считаются оказанными Партнером в его изначальном статусе, зарегистрированном в партнерской сети.<br/><br/>

                    По всем вопросам, не урегулированным в Договоре, Стороны руководствуются действующим законодательством РФ.
                </Typography>
            </Paper>
        
    );
};
