import { Paper, Typography } from "@mui/material";
import React from "react";

export const Privacy = () => {
    return (
        <Paper sx={{ width: "100%", padding: "20px" }}>
            <Typography>
                ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ
                <br />
                <br />
1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ<br /><br />

1.1 В настоящей Политике конфиденциальности используются следующие термины:<br /><br />

1.1.1. «Администрация игрового сайта «ochem.ru» (далее – Администрация сайта)» – уполномоченные на управление сайтом сотрудники и партнёры, действующие от имени «ochem.ru», которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.<br /><br />

1.1.2. «Персональные данные» — любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).
<br /><br />
1.1.3. «Обработка персональных данных» — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
<br /><br />
1.1.4. «Конфиденциальность персональных данных» — обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.
<br /><br />
1.1.5. «Пользователь данного игрового сайта (далее просто Пользователь)» – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее игровой сайт.
<br /><br />
1.1.6. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.
<br /><br />
1.1.7. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.
<br /><br />
ОБЩИЕ ПОЛОЖЕНИЯ
<br /><br />
2.1. Использование Пользователем сайта «ochem.ru» означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.
<br /><br />
2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование игрового сайта .
<br /><br />
2.3.Настоящая Политика конфиденциальности применяется только к игровому сайту «ochem.ru». Данный сайт не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте «ochem.ru».
<br /><br />
2.4. Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем игрового сайта.
<br /><br />
ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ
<br /><br />
3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта «ochem.ru» по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при регистрации на сайте, написанию отзывов, комментариев и прочее..
<br /><br />
3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы на сайте «ochem.ru» в разделе отзывы, контакты, комментарии и др. и включают в себя следующую информацию:
<br /><br />
3.2.1. адрес электронной почты (email);<br />
3.2.2. игровое имя (никнейм) пользователя;<br />
3.2.3. другие персональные данные, которые пользователь добровольно и по собственной инициативе разглашает и размещает в процессе использования сайта.<br />
3.3. Игровой сайт собирает и защищает Данные, которые автоматически передаются при посещении страниц сайта:<br />

IP-адрес<br />
информация из cookies<br />
информация о браузере (или иной программе, которая осуществляет доступ к показу рекламы)<br />
время доступа<br />
адрес страницы, на которой расположен рекламный блок<br />
реферер (адрес предыдущей страницы).<br /><br />
3.3.1. Отключение cookies может повлечь невозможность доступа к частям игрового сайта, требующим авторизации.
<br /><br />
3.3.2. Игровой сайт осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем.
<br /><br />
3.4. Любая иная персональная информация, не оговоренная выше, подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.
<br /><br />
ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ
<br /><br />
4.1. Персональные данные Пользователя Администрация сайта «ochem.ru» может использовать в целях:<br />
<br />
4.1.1. Идентификации Пользователя, зарегистрированного на игровом сайте, для формирования контента согласно определенным правилам «ochem.ru».
<br /><br />
4.1.2. Предоставления Пользователю доступа к персонализированным ресурсам сайта.
<br /><br />
4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта, оказания услуг, обработка запросов и заявок от Пользователя.
<br /><br />
4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.
<br /><br />
4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.
<br /><br />
4.1.6. Создания учетной записи, если Пользователь дал согласие на создание учетной записи.
<br /><br />
4.1.7. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем связанных с использованием Сайта.
<br /><br />
СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ
<br /><br />
5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.
<br /><br />
5.2. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.
<br /><br />
5.3. Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.
<br /><br />
ОБЯЗАТЕЛЬСТВА СТОРОН
<br /><br />
6.1. Пользователь обязан:
<br /><br />
6.1.1. Предоставить правдивую информацию о персональных данных, необходимую для пользования Сайтом.
<br /><br />
6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.
<br /><br />
6.2. Администрация сайта обязана:
<br /><br />
6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.
<br /><br />
6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности.
<br /><br />
6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.
<br /><br />
6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.
<br /><br />
ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
<br /><br />
9.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.
<br /><br />
9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте «ochem.ru», если иное не предусмотрено новой редакцией Политики конфиденциальности.
<br /><br />
9.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать в разделе контакты
<br /><br />
9.4. Действующая Политика конфиденциальности размещена на странице по адресу «ochem.ru».
            </Typography>
        </Paper>
    );
};
