import { Paper, Typography } from "@mui/material";
import React from "react";

export const Privacy = () => {
    return (
            <Paper sx={{ width: "100%", padding: "20px" }}>
                <Typography>
                    Политика в отношении обработки данных партнерской сети communicationcompass.ru
                    <br />
                    <br />
                    Согласно настоящей политике по обработке Персональных данных в партнерской сети communicationcompass.ru (далее — Политика) Самозанятый Саввинов Семён Афанасьевич, ИНН 140204032344 по поручению и/или по договору с Владельцем осуществляет обработку данных субъектов персональных, использующих Программный продукт communicationcompass.ru.
                    <br />
                    <br />
                    Условиями настоящей Политики урегулированы отношения по обработке Персональных данных исключительно в рамках совокупности информационных, программных и технических средств, доступ к которым предоставляется по адресу https://www.communicationcompass.ru/
                    <br />
                    <br />
                    1. Основные определения, используемые в Политике
                    <br />
                    <br />
                    Пользователь — Партнеры-физические лица, уполномоченные лица или сотрудники Партнеров, Рекламодателей, посетители интернет-страниц Программного продукта.  
                    <br />
                    <br />
                    Персональные данные — любая информация, которую Пользователь предоставляет о себе самостоятельно при регистрации или авторизации в Личном кабинете Партнерской сети, а также в процессе дальнейшего использования Программного продукта, а также информация, которая создается и собирается о Пользователе автоматически при использовании им Программного продукта.
                    <br />
                    <br />
                    Личный кабинет Пользователя — персональный раздел Программного продукта, к которому Пользователь получает доступ после прохождения регистрации и/или авторизации. Личный кабинет используется, в том числе, для сбора персональных данных Пользователя, получения Согласия, просмотра и управления доступными функциональными возможностями Программного продукта в отношении обработки Персональных данных.
                    <br />
                    <br />
                    Оператор — обработчик/организатор обработки Персональных данных Пользователей, которым определяются цели обработки, состав данных, действия с Персональными данными и иные условия обработки.  Оператором в рамках настоящей Политики является Владелец communicationcompass.ru.
                    <br />
                    <br />
                    Согласие — свободное и конкретное действие Пользователя в его интересе в рамках взаимодействия с Программным продуктом, создающее основание для обработки Персональных данных для заранее определенных целей обработки при условии, что обработка на ином основании не допускается в силу применимого законодательства.
                    <br />
                    <br />
                    В Политике также используются определения, установленные Условиями использования Партнерской сети communicationcompass.ru и иными обязательными документами для Пользователей.
                    <br />
                    <br />
                    2. Условия обработки Персональных данных
                    <br />
                    <br />
                    В рамках взаимодействия Пользователя с Программным продуктом на разных этапах такого взаимодействия Оператор может обрабатывать данные, которые получены от Пользователя напрямую или собраны автоматически (в том числе через инструменты продвижения).
                    <br />
                    <br />
                    Автоматически собираемые данные представляют собой различные технические идентификаторы привязанные к  устройству/браузеру Пользователя, которые создаются при использовании Программного продукта (посещении его страниц) или инструментов продвижения с помощью устройства/браузера, непосредственно Программным продуктом или имплементированными в него программным обеспечением третьих лиц.
                    <br />
                    <br />
                    Категории данных, получаемых от Пользователя
                    <br />
                    <br />
                    Данные имени, email и другие контактные данные, данные о стране регистрации, данные о средствах осуществления платежей, идентификационные номера.
                    <br />
                    <br />
                    Автоматически сбираемые данные
                    <br />
                    <br />
                    Сбор ведется через установку в браузере или устройстве Пользователя специальных файлов, которые широко известны под общим названием «куки-файлы». Собираемые таким образом данные могут включать в себя модель и операционную систему устройства, техническую информацию о браузере, IP-адрес, данные о событиях (действиях на интернет-ресурсе, переходы по ссылкам), пиксели, теги и иные. К этой категории также относится маркер Партнера.
                    <br />
                    <br />
                    Состав указанных категорий данных может меняться в связи с развитием возможностей Программного продукта или изменениями применимого законодательства.
                    <br />
                    <br />
                    При сборе Персональных данных напрямую от Пользователя Оператором презюмируется точность, полнота, достоверность и актуальность данных на условиях применимого к Пользователю договора в рамках Партнерской сети.
                    <br />
                    <br />
                    Способы, основания и цели
                    <br />
                    <br />
                    Обработка Персональных данных ведется через интернет с использованием автоматизированных и смешанных способов обработки (с использованием неавтоматизированных способов вместе с автоматизированными).
                    <br />
                    <br />
                    Возможные основания обработки и цели обработки:
                    <br />
                    <br />
                    Получены от Пользователя
                    <br />
                    <br />
                    Основание
                    <br />
                    <br />
                    (а) Обработка необходима для исполнения договора с Пользователем (в интересе Пользователя по договору с третьим лицом)
                    (б) Согласие
                    (в) Для осуществления прав и законных интересов Оператора
                    (г) Обработка необходима в силу требований законодательства
                    <br />
                    <br />
                    Цели
                    <br />
                    <br />
                    (а) Регистрация/авторизация Пользователя и заключение договоров в Партнерской сети, исполнение обязательств по ним
                    (б) Предоставление доступа к Программному продукту и его возможностям, обеспечение безопасности и поддержание его работы
                    (в) статистические, маркетинговые и иные исследования
                    (г) продвижение партнерских программ, функциональности Партнерской сети, иных продуктов и возможностей Партнерской сети
                    (д) направление Пользователю информационных и рекламных сообщений;
                    (е) Защита Программного продукта и интеллектуальной собственности
                    <br />
                    <br />
                    Операции
                    <br />
                    <br />
                    сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (без распространения), обезличивание, блокирование, удаление, уничтожение.
                    <br />
                    <br />
                    Собраны автоматически
                    <br />
                    <br />
                    Основание
                    <br />
                    <br />
                    (а) Обработка необходима для исполнения договора с Пользователем (в интересе Пользователя по договору с третьим лицом)
                    (б) Согласие
                    (в) Для осуществления прав и законных интересов Оператора
                    <br />
                    <br />
                    Цели
                    <br />
                    <br />
                    (а) Регистрация/авторизация Пользователя и заключение договоров в Партнерской сети, исполнение обязательств по ним
                    (б) Предоставление доступа к Программному продукту и его возможностям, обеспечение безопасности и поддержание его работы
                    (в) статистические, маркетинговые и иные исследования
                    (г) продвижение партнерских программ, функциональности Партнерской сети, иных продуктов и возможностей Партнерской сети
                    (д) направление Пользователю информационных и рекламных сообщений;
                    (е) сохранение настроек и персонализация Программного продукта
                    (ж) Защита Программного продукта и интеллектуальной собственности
                    <br />
                    <br />
                    Операции
                    <br />
                    <br />
                    сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (без распространения), обезличивание, блокирование, удаление, уничтожение.
                    <br />
                    <br />
                    Оператор при обработке любой категории данных может одновременно преследовать более одной цели, а также иметь более одного основания для обработки.
                    <br />
                    <br />
                    Специальные категории Персональных данных в рамках Партнерской сети не обрабатываются.
                    <br />
                    <br />
                    Дополнительная информация о процессах обработки
                    <br />
                    <br />
                    По общему правилу срок обработки и хранения Персональных данных в рамках Политики исчисляется с даты сбора и до достижения всех целей обработки либо прекращения всех оснований для обработки. Для отдельных Персональных данных может устанавливаться иной срок (порядок его определения), который указывается в интерфейсе Программного продукта до начала сбора.
                    <br />
                    <br />
                    Оператор хранит Персональные данные и обеспечивает их охрану от несанкционированного доступа и незаконного распространения в соответствии с внутренними правовыми, организационными и техническими правилами и регламентами, применимым законодательством.  
                    <br />
                    <br />
                    В отношении Персональных данных Пользователя сохраняется их конфиденциальность, за исключением случаев, когда технология Программного продукта либо настройки используемого Пользователем программного обеспечения предусматривают открытый обмен информацией с иными лицами и их программными комплексами в интернете.
                    <br />
                    <br />
                    Оператор гарантирует соблюдение мер защиты Персональных данных такими лицами согласно стандартам настоящей Политики и требованиям законодательства.
                    <br />
                    <br />
                    3. Обработка данных Пользователей третьими лицами
                    <br />
                    <br />
                    В рамках Партнерской сети communicationcompass.ru ряд процессов и/или операций по обработке Персональных данных может подразумевать привлечение услуг третьих лиц – технических, инфраструктурных, маркетинговых и иных провайдеров.
                    <br />
                    <br />
                    Все провайдеры (третьи лица), привлекаемые к обработке Персональных данных, связаны договорными обязательствами с Оператором и/или Владельцем и применяют меры защиты Персональных данных при их обработке в объеме не меньшем, чем предусмотрено настоящей Политикой и правилами и регламентами Партнерской сети communicationcompass.ru.
                    <br />
                    <br />
                    Пользователь вправе получить информацию о таких провайдерах и обработке его Персональных данных провайдерами обратившись к Оператору в порядке, который предусмотрен настоящей Политикой.
                    <br />
                    <br />
                    4. Права Пользователя
                    <br />
                    <br />
                    Оператор обеспечивает реализацию предусмотренных законодательством прав Пользователей, как субъектов персональных данных, в том числе, по их обращению и с учетом положений и сроков, которые установлены законодательством.  
                    <br />
                    <br />
                    Так, например, Пользователь вправе в любой момент отзывать предоставленное Согласие на обработку, используя возможности интерфейса Программного продукта, функциональность своего устройства доступа в интернет, настройки браузера, обратившись к Оператору напрямую.
                    <br />
                    <br />
                    В случае отзыва Согласия Пользователем обработка прекращается, а данные полностью уничтожаются/удаляются Оператором и/или соответствующим провайдером. Оператор вправе не прекращать обработку тех данных, для которых есть иные (кроме Согласия) основания для обработки.
                    <br />
                    <br />
                    Способы направления запросов Оператору: по адресу электронной почты hrminer@mail.ru
                    <br />
                    <br />
                    Оператор при получении обращения вправе потребовать от Пользователя предоставления дополнительных сведений для верификации направления такого обращения непосредственно от субъекта Персональных данных, в связи с которыми подано обращение, либо от уполномоченного таким субъектом лицом.
                    <br />
                    <br />
                    5. Заключительные положения
                    <br />
                    <br />
                    Политика регулируется и толкуется в соответствии с законодательством Российской Федерации и является действующей для всех Пользователей. Все вопросы, не урегулированные в ней, подлежат разрешению в соответствии с законодательством Российской Федерации.
                    <br />
                    <br />
                    Текст настоящей Политики может быть изменен без предварительного уведомления Пользователя, если это допускается законодательством, в противном случае Пользователи будут предварительно уведомлены об изменении Политики в установленные законодательно сроки.
                    <br />
                    <br />
                    Уведомления об изменении направляются по адресам электронной почты Пользователей, если электронные почты для направления уведомления доступны Оператору.
                </Typography>
            </Paper>
    );
};
