import { Paper, Typography } from "@mui/material";
import React from "react";

export const Reff = () => {
    return (
        
            <Paper sx={{ width: "100%", padding: "20px" }}>
                <Typography>
                    Правила реферальной программы communicationcompass.ru
                    <br />
                    <br />
                    Реферальная программа communicationcompass.ru направлена на расширение количества участников Партнерской сети путем их привлечения действующими участниками (Партнерами) и вместе с этим признается одной из партнерских программ. Для целей Реферальной программы communicationcompass.ru выступает в качестве Рекламодателя, в соответствии с определением этого термина, указанным в условиях использования communicationcompass.ru.
                    <br />
                    <br />
                    Термины
                    <br />
                    <br />
                    Реферал — зарегистрированный участник Партнерской сети, привлеченный действующим Партнером в результате оказания им услуг по привлечению рефералов и соответствующий требованиям, установленным настоящими Условиями.
                    <br />
                    <br />
                    Услуги по привлечению рефералов — оказываемые вами услуги Партнера по привлечению новых участников Партнерской сети для целей их последующей регистрации в Партнерской сети.
                    <br />
                    <br />
                    Реферальная ставка — ставка, используемая для расчета стоимости услуг по привлечению рефералов.
                    <br />
                    <br />
                    Никнейм — уникальное имя Партнера в Партнерской сети, которое указывается Партнером при регистрации.
                    <br />
                    <br />
                    Все прочие специальные термины, используемые в настоящих Условиях, имеют те же значения, что присвоены им в рамках условий использования communicationcompass.ru и применимого к вам договора-оферты.
                    <br />
                    <br />
                    Настоящая редакция Условий заменяет собой любые другие условия Реферальной программы, начиная с даты ее размещения на соответствующей странице. Присоединившись к Реферальной программе, вы соглашаетесь соблюдать следующие условия.
                    <br />
                    <br />
                    При привлечении рефералов
                    <br />
                    <br />
                    1.1. Вы не должны (случайно или намеренно) использовать запрещенные типы трафика в том числе и при оказании услуг Партнера по иным партнерским программам, в частности, указываемые дополнительно в соответствующем разделе на страницах партнерских программ.
                    <br />
                    <br />
                    При привлечении рефералов вы можете привлекать трафик только через рекламные сети.
                    <br />
                    <br />
                    Однозначно не допускается привлечение рефералов через контекстную рекламу, попапы, кликандеры, поп-андеры, тизерную рекламу, тулбары, айфреймы, сквоттинг, мистейпинг, адалт, дорвей, редирект, пуши и другие, прямо не разрешенные типы трафика.
                    <br />
                    <br />
                    1.2. Вы не должны использовать фирменный стиль и/или товарный знак communicationcompass.ru, кроме случаев, согласованных с Рекламодателем. Вы не должны использовать рекламные объявления PPC, которые либо содержат URL-адрес и/или товарный знак (бренд) communicationcompass.ru, кроме случаев, согласованных с Рекламодателем. При нарушении этого условия вы будете незамедлительно и навсегда отключены от Реферальной программы без права на оплату за привлечение рефералов согласно настоящим Условиям.
                    <br />
                    <br />
                    1.3. При привлечении рефералов вы вправе размещать реферальные ссылки только на собственных ресурсах (каналах трафика): сайте, группах/чатах в мессендежерах, рассылке по базе ваших подписчиков.
                    <br />
                    <br />
                    1.4. Вы обязуетесь использовать только те рекламные материалы и инструменты для привлечения рефералов, которые представлены в рамках партнерской сети communicationcompass.ru. На момент опубликования настоящей редакции Условий единственным допустимым инструментом для привлечения рефералов является реферальная ссылка.
                    <br />
                    <br />
                    1.5. Вы обязуетесь соблюдать любые другие применимые условия привлечения рефералов, публикуемые и, время от времени, обновляемые на странице Реферальной программы.
                    <br />
                    <br />
                    1.6. Запрещается регистрироваться в качестве реферала с использованием собственных новых средств регистрации в партнерской сети communicationcompass.ru (самому быть своим рефералом).
                    <br />
                    <br />
                    Оплата
                    <br />
                    <br />
                    2.1. Стоимость ваших услуг по привлечению рефералов рассчитывается по ставке, указанной в настоящих Условиях, если целевые действия конечного клиента фактически совершены с соблюдением правил соответствующей партнерской программы.
                    <br />
                    <br />
                    Стоимость услуг: за реферала 1 уровня = 500 рублей, за реферала 2 уровня = 200 рублей, за реферала 3 уровня = 100 рублей, за реферала 4 уровня = 100 рублей, за реферала 5 уровня = 100 рублей. Стоимость услуг выплачивается в порядке, который предусмотрен применимым к вам договором-офертой в актуальной редакции.
                    <br />
                    <br />
                    2.2. Рефералами, чьи услуги могут быть учтены в рамках реферальной базы для расчета стоимости ваших услуг по привлечению рефералов являются все лица, которые зарегистрировались в качестве Партнеров в результате перехода по сформированной вами ссылке для привлечения новых Партнеров, при одновременном соблюдении каждого из следующих условий:
                    <br />
                    <br />
                    а) регистрация привлеченного лица была выполнена именно на странице, на которую такое лицо попало в результате прямого перехода по сформированной вами по реферальной ссылке в течение 30 (тридцати) дней с даты такого перехода или с указанием вашего Никнейма при регистрации;
                    <br />
                    <br />
                    б) регистрация была выполнена лицом без нарушения условий партнерской сети communicationcompass.ru;
                    <br />
                    <br />
                    Все лица, зарегистрированные в партнерской сети communicationcompass.ru, но не удовлетворяющие совокупности указанных критериев, не считаются рефералами согласно настоящим Условиям.
                    <br />
                    <br />
                    2.3. Для целей расчета реферальной базы учитываются все переходы по URL-адресам с кодом-идентификатором (маркером), присвоенным вашему рефералу. При этом учитываются целевые действия, совершенные в течение срока жизни файлов cookie, начиная с первого дня посещения интернет-ресурса или сервиса соответствующего Рекламодателя после перехода по ссылке с кодом-идентификатором привлеченного вами реферала, но в пределах периода учета реферальной базы.
                    <br />
                    <br />
                    2.4. Вы можете получать статистику о целевых действиях, начисленных за рефералов суммах и другие показатели оказания услуг по привлечению рефералов в личном кабинете. Стоимость услуг по привлечению рефералов за предыдущий месяц, выплачивается согласно правилам выплат и применимому договору-оферте на ваши платежные реквизиты, указанные в личном кабинете.
                    <br />
                    <br />
                    2.5. Перечень включенных в Реферальную программу партнерских программ: участвуют все партнерские программы, действующие в Партнерской сети на конкретную дату.
                </Typography>
            </Paper>
    );
};
