import { Paper, Typography } from "@mui/material";
import React from "react";

export const Terms = () => {
    return (
            <Paper sx={{ padding: "10px", width: "100%" }}>
                <Typography>
                    Условия использования партнёрской сети communicationcompass.ru
                    <br />
                    <br />
                    Перед тем, как стать участником партнерской сети, пожалуйста, ознакомьтесь с этими правилами, а также иными обязательными для участников документами, размещенными в Базе знаний. 
                    <br />
                    <br />
                    1. Общие положения
                    <br />
                    <br />
                    1.1. В настоящем документе определяются основные принципы, условия и способы допустимого использования Программного продукта и участия в Партнерской сети communicationcompass.ru (далее — Правила).
                    <br />
                    <br />
                    1.2. Права на товарный знак communicationcompass.ru и весь программный и графический комплекс Партнерской сети принадлежат и управляются Самозанятым Саввиновым Семёном Афанасьевичем ИНН 140204032344 (далее — Владелец).
                    <br />
                    <br />
                    1.3. Основные определения:
                    <br />
                    <br />
                    Партнерская сеть — форма делового сотрудничества между Владельцем, Рекламодателями и Партнерами, реализованная на https://www.communicationcompass.ru/, направленная на продвижение Партнерами в интернете товаров и/или услуг Рекламодателей и третьих лиц в результате оказания Услуг Партнера.
                    <br />
                    <br />
                    Услуги Партнера — услуги по привлечению трафика, то есть по привлечению интернет-пользователей к совершению Целевого Действия – приобретения товаров и/или услуг Рекламодателей и третьих лиц с помощью Программного продукта и сервисов Владельца, оказываемые Партнером на возмездной основе.
                    <br />
                    <br />
                    Целевое Действие — фактически выкупленные и не отмененные покупка Товаров-услуг, а также иное действие конечного пользователя (клиента), признаваемое целевым в рамках соответствующей Партнерской программы, завершившееся сделкой с завершенной оплатой или без таковой, на основании которых Владелец получает свое вознаграждение от Рекламодателя в рамках Партнерской сети. Предмет и вид такой сделки определяются Рекламодателем самостоятельно и могут изменяться время от времени.
                    <br />
                    <br />
                    Рекламодатели — юридические или физические лица-участники Партнерской сети, предлагающие рекламировать и продвигать иными способами свои товары и/или услуги путем предоставления рекламных материалов в рамках Партнерских программ.
                    <br />
                    <br />
                    Партнеры — юридические или физические лица — авторизованные участники Партнерской сети, которые осуществляют рекламное или иное продвижение предложений Рекламодателей, оказывая Услуги Партнера.
                    <br />
                    <br />
                    Программный продукт — совокупность информационных, программных и технических средств, доступ к которым предоставляется на https://www.communicationcompass.ru/ для:
                    <br />
                    <br />
                    регистрации в Партнерской сети и получения доступа к Личному кабинету Партнера, доступа к Инструментам продвижения Партнерских программ;<br />
                    получения статистики Партнера о результатах привлечения Целевых Действий для расчета объема и стоимости Услуг Партнера;<br />
                    получения программных решений и инструментов для оценки эффективности оказания услуг и повышения эффективности монетизации интернет-ресурсов (проектов) Партнера, задействованных в рамках Партнерской сети;<br />
                    получения информации о работе и непосредственному использованию Инструментов продвижения, правилах их использования и распространения с их помощью, в том числе, рекламной информации о Товарах-услугах;<br />
                    получения справочной информации о Владельце, Рекламодателях, рынке Товаров-услуг и возможностях монетизации интернет-проектов Партнеров с помощью Базы знаний.
                    <br />
                    <br />
                    Партнерская программа — совокупность правил и условий привлечения клиентов для совершения Целевого Действия  по конкретному Товаре-услуге или совокупности Товаров-услуг одного Рекламодателя либо неопределенного количества третьих лиц-поставщиков таких услуг с помощью Инструментов продвижения Владельца.
                    <br />
                    <br />
                    Инструменты продвижения — программные инструменты Владельца и/или Рекламодателей, предоставляемые Партнерам на условиях настоящих Правил и договора-оферты для оказания Услуг Партнера в целях привлечения клиентов для совершения Целевого Действия. Подробный перечень Инструментов продвижения и информация о них доступны по ссылке.
                    <br />
                    <br />
                    Товары-услуги — доступные к приобретению товары и/или услуги, информация о которых размещена на сервисах Владельца и официальных сайтах Рекламодателей.
                    <br />
                    <br />
                    Личный кабинет — раздел интерфейса Программного продукта, который содержит визуальное отображение его функционала и реализует возможность осуществления определенных действий Владельцем, Партнерами и Рекламодателями для осуществления сотрудничества в рамках Партнерской сети. 
                    <br />
                    <br />
                    База знаний — раздел Партнерской сети по электронному адресу https://communicationcompass.ru/support, содержащий подробные сведения о работе Программного продукта, его правомерном использовании, а также ответы на часто возникающие вопросы. В Базе знаний публикуются настоящие Правила, политики Партнерской сети и отдельные обязательные условия сотрудничества.
                    <br />
                    <br />
                    Приведенные определения имеют такое же значение в любых иных юридических документах (правилах, условиях, соглашениях и т.п.), которые действуют в Партнерской сети.
                    <br />
                    <br />
                    2. Условия участия в Партнерской сети и использования Программного продукта
                    <br />
                    <br />
                    2.1. Регистрация. Чтобы стать Партнером, необходимо пройти процесс регистрации на странице Партнерской сети, используя свой действующий email. В случае регистрации от имени юридического лица необходимо оставить корпоративный email, доступ к которому в целях авторизации Партнер сможет сохранить на протяжении всего сотрудничества.
                    <br />
                    <br />
                    2.2. Для последующей авторизации Партнер использует email, указанный при регистрации, логин и пароль. С момента регистрации и первой авторизации в Партнерской сети, Владелец присваивает партнеру уникальный код-идентификатор (маркер) и предоставляет доступ к Личному кабинету для последующего целевого использования его функциональных возможностей.
                    <br />
                    <br />
                    2.3. Партнер самостоятельно обеспечивает сохранность своего логина и пароля для авторизации в Партнерской сети. Презюмируется, что все действия с момента авторизации, которые совершаются прямо или косвенно с использованием функциональных возможностей Личного кабинета или Инструментов продвижения, осуществляются непосредственно Партнером или другим лицом, законно получившим полномочия от Партнера на осуществление таких действий.
                    <br />
                    <br />
                    3. Инструменты и Партнерские программы
                    <br />
                    <br />
                    3.1. Партнер имеет доступ к определенным Инструментам продвижения Товаров-услуг согласно правилам соответствующих Партнерских программ, участником которых является Партнер.
                    <br />
                    <br />
                    3.2. С момента первой авторизации каждый Партнер по умолчанию считается участником Партнерских программ Владельца и реферальных программ communicationcompass.ru.
                    <br />
                    <br />
                    3.3. Партнер имеет возможность из Личного кабинета подключиться к любой другой Партнерской программе, которая представлена в рамках Партнерской сети. Информация о каждой программе, порядок подключения и специальные правила соответствующей Партнерской программы содержатся на ее уникальной странице. Подключение к одной из программ означает согласие Партнера с ее правилами.
                    <br />
                    <br />
                    3.4. Список всех доступных к подключению программ содержится на странице Личного кабинета Партнера. Некоторые из Партнерских программ могут быть подключены Партнером только после предварительного согласия Рекламодателя.
                    <br />
                    <br />
                    3.5. Для оказания Услуг Партнера используются только те инструменты, которые доступны для соответствующей программы и реализуются исключительно с помощью функциональных возможностей Программного продукта в рамках графического интерфейса Личного кабинета.
                    <br />
                    <br />
                    3.6. Использование Инструментов продвижения должно осуществляться согласно Правилам, договору-оферте, правилам соответствующих программ и исключительно на законно администрируемых Партнером интернет-ресурсах с использованием маркера Партнера (сайты, мобильные приложения, страницы в социальных сетях и т. п.).
                    <br />
                    <br />
                    3.7. Использование и размещение отдельных Инструментов продвижения на отдельных территориях, а также оказание Услуг Партнера в силу применимого законодательства допускается только при условии предоставления дополнительных данных и информации от Партнера. Состав таких данных и информации, а также допустимые варианты размещения Инструментов продвижения в любом случае заранее доводятся до сведения Партнера на соответствующих страницах интерфейса Программного продукта.
                    <br />
                    <br />
                    3.8. Владелец или уполномоченные им лица будут самостоятельно и за Партнера выполнять обязательства, связанные с использованием и размещением Инструментов продвижения на отдельных территориях и оказанием Услуг Партнера, если такая возможность предусмотрена применимым законодательством, возможностями Партнерской сети и при этом Партерном предоставлены все необходимые достоверные данные и информация. В противном случае обязанности по выполнению применимых на соответствующей территории требований использования и размещения Инструментов продвижения за Партнера не передаются Владельцу.
                    <br />
                    <br />
                    4. Статистика и оплата Услуг Партнера
                    <br />
                    <br />
                    4.1. Оказанные Услуги Партнера оплачиваются Владельцем или уполномоченным им юридическим лицом только в случае привлечения Партнером целевого трафика, то есть, если клиент, привлеченный в результате их оказания, совершил Целевое Действие. 
                    <br />
                    <br />
                    4.2. Целевое Действие обязательно должно быть совершено после перехода клиента с интернет-ресурса Партнера на страницу, указанную Рекламодателем в соответствующей Партнерской программе, с помощью Инструментов продвижения, правомерно используемых Партнером.
                    <br />
                    <br />
                    4.3. Расчет стоимости Услуг Партнера осуществляется в соответствии с условиями договора-оферты и специальными правилами расчета стоимости услуг по конкретным Партнерским программам в зависимости от Целевого действия, являющегося основанием для выплаты.
                    <br />
                    <br />
                    4.4. Расчет стоимости производится на основании данных статистики привлечения трафика, формируемой в рамках Партнерской сети. Такая статистика является единственным достоверным источником данных о стоимости Услуг Партнера. Партнер соглашается, что данные статистики могут использоваться Владельцем для целей отечности о размещении рекламной информации в интернете и имеют силу учетного документа (например, акта), если договором с Партнером прямо не предусмотрено иное.
                    <br />
                    <br />
                    4.5. Партнер имеет возможность отслеживать статистику и эффективность использования им Инструментов продвижения и получать информацию о сумме, причитающейся ему в качестве оплаты Услуг Партнера, в режиме реального времени на соответствующей странице Личного кабинета.
                    <br />
                    <br />
                    4.6. Порядок оплаты Услуг Партнера определяется условиями договора-оферты, настоящими Правилами и правилами конкретной Партнерской программы.
                    <br />
                    <br />
                    4.7. Для получения выплат Партнер обязательно должен указать в Личном кабинете реквизиты своего платежного инструмента и при наличии возможности выбрать валюту платежей. Владелец до осуществления каждой выплаты вправе запросить любую дополнительную информацию или ее подтверждение от Партнера, если такая информация требуется Владельцу для выплаты в соответствии с применимым законодательством или условиями банков, платежных систем и иных провайдеров платежей.
                    <br />
                    <br />
                    4.8. Подробный порядок оплаты Услуг Партнера в зависимости от используемого Партнером платежного инструмента, основания для выплаты, Рекламодателя, особенностей партнерских Программ и т. п. содержится в разделе Базы знаний, который считается неотъемлемой частью настоящих Правил.
                    <br />
                    <br />
                    5. Запрещенные действия
                    <br />
                    <br />
                    5.1. Не допускается использование Программного продукта способами, отличными от прямо разрешенных Владельцем и не удовлетворяющими целям Партнерской сети, незаконными способами, а также использование Программного продукта с целью нарушения прав и законных интересов третьих лиц.
                    <br />
                    <br />
                    5.2. Партнеры не должны каким-либо способом вмешиваться в работу Программного продукта. Любые технические или программные модификации кода Программного продукта или его функционала не допускаются.
                    <br />
                    <br />
                    5.3. При использовании возможностей Программного продукта, в частности, Инструментов продвижения, в рамках оказания Услуг Партнеры не должны использовать несогласованные и запрещенные типы трафика (типы проектов или интернет-ресурсов).
                    <br />
                    <br />
                    5.5. При этом другие запрещенные действия, не указанные в настоящих Правилах, и особые условия по допустимым типам трафика (типам проектов или интернет-ресурсов) для отдельных Партнерских программ могут быть установлены правилами таких программ и должны быть указаны на их странице в Личном кабинете.
                    <br />
                    <br />
                    6. Интеллектуальная собственность
                    <br />
                    <br />
                    6.1. Все объекты интеллектуальной собственности, в частности, товарные знаки, логотипы, фирменные знаки, подписи, графические знаки, текстовые материалы, Инструменты продвижения, иные программные комплексы, размещаемые в рамках Программного продукта, принадлежат Владельцу, Рекламодателям и третьим лицам, привлекаемым на стороне Владельца или Рекламодателей Партнерской сети.
                    <br />
                    <br />
                    6.2. Партнеры не имеют права использовать объекты интеллектуальной собственности, указанные в п. 6.1. вне предполагаемого в связи с участием в Партнерской сети сотрудничества и функционала Программного продукта.
                    <br />
                    <br />
                    6.3. Факт использования Партнерами в рамках сотрудничества функционала Программного продукта, Инструментов продвижения, интерфейса Личного кабинета и т. д. не означает получение Партнерами каких-либо имущественных прав на объекты интеллектуальной собственности, которые размещены Владельцем в Партнерской сети, за исключением прав, прямо предусмотренных договором-офертой.
                    <br />
                    <br />
                    6.4. Партнеры обязаны соблюдать законные интересы и права третьих лиц, в частности, касающиеся прав на любые объекты интеллектуальной собственности, при продвижении любого Товара-услуги или совокупности Товаров-услуг одного Рекламодателя либо неопределенного количества третьих лиц-поставщиков Товаров-услуг с помощью Инструментов продвижения Владельца.
                    <br />
                    <br />
                    6.5. В случае несанкционированного правилами Партнерской сети и применимым законодательством копирования/имитирования фирменного стиля, логотипов, названий, доменных наименований, контента и т. п. Владельца, Рекламодателей, поставщиков Товаров-услуг и любых третьих лиц Партнером, Владелец вправе прекратить договорные отношения с нарушителем и ограничить его возможности по использованию функционала Программного продукта полностью или частично до устранения нарушения или навсегда.
                    <br />
                    <br />
                    6.6. Владелец может воспользоваться установленным в п. 6.5. правом и в случаях, когда нарушитель хоть и не использует указанные объекты интеллектуальной собственности напрямую, но своими действиями может потенциально ввести конечных пользователей в заблуждение относительно связи своего интернет-ресурса с Владельцем, Рекламодателем, поставщиком Товара-услуги или другим третьим лицом.
                    <br />
                    <br />
                    7. Заключительные положения
                    <br />
                    <br />
                    7.1. Владелец вправе в одностороннем порядке в любое время и без предварительного уведомления Партнеров изменять настоящие Правила, отдельные правила Партнерских программ, иные обязательные документы, составляющие условия использования Партнерской сети. Любые такие изменения вступают в силу с момента их публикации, если иное не предусмотрено в тексте изменений.
                    <br />
                    <br />
                    7.2. Изменения настоящих Правил, договора-оферты и основных политик могут публиковаться на страницах Программного продукта таким образом, чтобы Партнер имел реальную возможность с ними ознакомиться. Изменения правил Партнерских программ размещаются на страницах программ и могут быть опубликованы в соответствующем разделе Личного кабинета.
                    <br />
                    <br />
                    7.3. Недействительность одного или нескольких условий настоящих Правил независимо от причины такой недействительности не означает, что прочие условия и положения Правил не имеют юридической силы и не применяются в отношении Партнеров.
                    <br />
                    <br />
                    7.4. Владелец вправе проконсультировать Партнеров по их запросу по технической, юридической и иной специфике работы Программного продукта и сотрудничества в рамках Партнерской сети.
                    <br />
                    <br />
                    7.5. Для получения консультации или ответа на иные обращения Партнер может обратиться по электронному адресу hrminer@mail.ru. Консультации оказываются в рабочие дни, срок ответа на обращение — до 30 (тридцати) календарных дней. Для более скорого ответа или получения консультации Партнеру необходимо точно и полно изложить суть обращения/вопроса.
                    <br />
                    <br />
                    7.6. Настоящие Правила являются одним из обязательных документов в рамках сотрудничества в Партнерской сети наряду с применимым для конкретного Партнера договором-офертой, соглашением об обработке персональных данных и отдельными положениями Базы знаний, регулирующими условия выплат и использования Инструментов продвижения, а также условиями Партнерских программ, участником которых является Партнер.
                </Typography>
            </Paper>
    );
};
